#+TITLE: Week 3.24 Math Homework
#+AUTHOR: 2024110144
#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS: [a4paper,10pt]
#+LATEX_HEADER: \usepackage[margin=0.5in]{geometry}
#+OPTIONS: \n:t toc:nil num:nil date:nil

#+begin_comment
3.24
thomas 14.10 1-12 even
导论下 6.3 7,9,11,12,13
3.26
thomas 14.7 1-74 mod 6
3.28
thomas 14.8 1-54 mod 6
#+end_comment

** 66
#+name: point-list
| -2 | 0 |
|  0 | 2 |
|  2 | 3 |

#+begin_src scheme :var pl=point-list :var pred-x=4 :exports both
  (define (^2 x)
    (* x x))

  (define (sum:x x)
    (apply + x))

  (define (sum:x^2 x)
    (apply + (map (lambda (element) (^2 element)) x)))

  ;; use pair to represent a dot (x,y)
  (define (point x y) (cons x y))
  (define (point-x random-point) (car random-point))
  (define (point-y random-point) (cdr random-point))

  (define (point-list-processor point-list)
    (map (lambda (lst) (point (car lst)
			      (cadr lst)))
	 point-list))

  (define (calc:m&b points)
    "calculate a list of points for the value of m and b"
    (if (null? points)
	(error "required non-empty input")
	(let ((n (length points))
	      (x_ks (map (lambda (p) (point-x p))
			 points))
	      (y_ks (map (lambda (p) (point-y p))
			 points)))
	  (let* ((m (/ (- (* (sum:x x_ks) (sum:x y_ks))
			  (* n (sum:x (map (lambda (p) (* (point-x p) (point-y p))) points))))
		       (- (^2 (sum:x x_ks))
			  (* n (sum:x^2 x_ks)))))
		 (b (/ (- (sum:x y_ks)
			  (* m (sum:x x_ks)))
		       n)))
	    (values m b)))))

  (define (make-line m b)
    (values (format #f "y=~ax+~a" m b)
	    (lambda* (#:key x)
	      (+ b (* m x)))))

  (call-with-values (lambda () (call-with-values (lambda () (calc:m&b (point-list-processor pl)))
				 make-line))
    (lambda (formula predicate)
      (list (list "formula" formula)
	    (list "prediction" (predicate #:x pred-x)))))
#+end_src

#+RESULTS:
| formula    | y=3/4x+5/3 |
| prediction | 14/3       |

